---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.NumberPartitionParam
source: html/6e26377c-cba6-7cf8-a0a6-c3048058467a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.NumberPartitionParam Property

"Partition"

## Syntax (C#)
```csharp
public static ForgeTypeId NumberPartitionParam { get; }
```